Examinator/src/Documents/ПроведениеПреподавателемОбученияСУО/ПроведениеПреподавателемОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПреподавателемОбученияСУО</name>
  <registerRecords>InformationRegister.ПроведениеПреподавателямиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.РасписаниеПреподавателейСУО</registerRecords>
  <registerRecords>InformationRegister.ПреподавателиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПроведение</name>
    <type>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проведено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьОтУченика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоПросмотрВедомости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Examinator/src/InformationRegisters/ПроведениеПреподавателямиОбученияСУО/ПроведениеПреподавателямиОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроведениеПреподавателямиОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПродолжительностьВЧасах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроцессаПреподаванияСУО</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Проведено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоПросмотрВедомости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПреподавателиОбученияСУО/ПреподавателиОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПреподавателиОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Проведено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьОтУченика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/РасписаниеПреподавателейСУО/РасписаниеПреподавателейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасписаниеПреподавателейСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Проведено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПроведение</name>
    <type>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветНаКалендаре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/БиблиотекаПользователейСУО/БиблиотекаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БиблиотекаПользователейСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Библиотека</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.СхемыМероприятийСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.ЛитератураСУО</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ЗаданияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеКнигиСУО</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДокументыТребующиеПерепроведенияСУО/ДокументыТребующиеПерепроведенияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыТребующиеПерепроведенияСУО</name>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗаписиДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьПодчиненныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПовтора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыУчебныхАктивностейСУО/ТипыУчебныхАктивностейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУчебныхАктивностейСУО</name>
  <enumValues>
    <name>Обучение</name>
  </enumValues>
  <enumValues>
    <name>Преподавание</name>
  </enumValues>
  <enumValues>
    <name>Контроль</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПроведениеПреподавателемОбученияСУО/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Перем ПометкаУдаленияИзменена;
	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Делаем проверки
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОПроведенииМероприятия = УправлениеОбучениемСУОПовтИсп.ДанныеМероприятия(ПроведениеОбучения, "Проведен, Мероприятие");
	
	ДокументПроведениеОбученияПроведен = ДанныеОПроведенииМероприятия.Проведен;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ ДокументПроведениеОбученияПроведен Тогда
		Текст = НСтр("ru = 'Проведите основной документ обучения ""%1""'");
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ПроведениеОбучения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	// Получаем даты проведения
	
	ДатаНачалаПроведенияЗапланированная = Документы.ПроведениеОбученияСУО.ДатаНачалаПроведения(ПроведениеОбучения, Сценарий);
	
	Если ЗначениеЗаполнено(ДатаНачалаПроведенияЗапланированная) Тогда
		ДатаНачалаПроведения = ДатаНачалаПроведенияЗапланированная;
	Иначе
		ДатаНачалаПроведения = Дата("00010101");
	КонецЕсли;
	
	ДатаОкончанияПроведенияЗапланированная = Документы.ПроведениеОбученияСУО.ДатаОкончанияПроведения(ПроведениеОбучения, Сценарий);
	
	Если ЗначениеЗаполнено(ДатаОкончанияПроведенияЗапланированная) Тогда
		ДатаОкончанияПроведения = ДатаОкончанияПроведенияЗапланированная;
	Иначе
		ДатаОкончанияПроведения = Дата("00010101");
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Ссылка)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") <> ПометкаУдаления Тогда
		
		ПометкаУдаленияИзменена = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаленияИзменена Тогда
		ОбновитьПроведениеОбучения();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	МероприятиеОтменено = Документы.ПроведениеПреподавателемОбученияСУО.Отменено(Ссылка);
	
	Движения.ПроведениеПреподавателямиОбученияСУО.Записывать = Истина;
	Движения.ПреподавателиОбученияСУО.Записывать             = Истина;
	Движения.РасписаниеПреподавателейСУО.Записывать          = Истина;
	Движения.БиблиотекаПользователейСУО.Записывать           = Истина;
	
	Если НЕ МероприятиеОтменено Тогда
		
		ДанныеПроведенияОбучения = УправлениеОбучениемСУОПовтИсп.ДанныеМероприятия(ПроведениеОбучения, 
			"БезСценария,
			|НаОсновеМероприятия,
			|НаОсновеЭлектронногоРесурса,
			|Мероприятие,
			|ЭлектронныйРесурс,
			|Наименование, 
			|ВидОбучения, 
			|Статус, 
			|ЦветЗапланированногоМероприятияНаКалендареПреподавателя, 
			|ЦветАктивногоМероприятияНаКалендареПреподавателя, 
			|ЦветЗавершенногоМероприятияНаКалендареПреподавателя, 
			|ЦветОтмененногоМероприятияНаКалендареПреподавателя,
			|ДатаНачалаПроведения,
			|ДатаОкончанияПроведения,
			|ДатаНачалаДоступа,
			|ДатаКонтроля,
			|ПродолжительностьВСекундах,
			|ВариантПродолжительности");
		
		Если ТипЗнч(Сценарий) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда			
			ДанныеОМероприятии = УправлениеОбучениемСУОПовтИсп.ДанныеМероприятия(Сценарий, "Значимость, ШкалаОценки, Вид, ШкалаОценки, МестоПроведения, ПродолжительностьВСекундах");
			ВидОбучения        = ДанныеОМероприятии.Вид;
		Иначе
			ДанныеОМероприятии = Неопределено;
			ВидОбучения        = Документы.ПроведениеОбученияСУО.ВидОбучения(ДанныеПроведенияОбучения, Сценарий);
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(РодительскоеПроведение) Тогда
			
			Движение = Движения.ПроведениеПреподавателямиОбученияСУО.Добавить();
			
			Движение.ПроведениеОбучения          = ПроведениеОбучения;
			Движение.Сценарий                    = Сценарий;
			Движение.Преподаватель               = Пользователь;
			
			Движение.Проведено                   = Проведено;
			Движение.ДатаНачалаПроведения        = ДатаНачалаПроведения;
			Движение.ДатаОкончанияПроведения     = ДатаОкончанияПроведения;
			Движение.Дата                        = Дата;
			
			Движение.Вид                         = ВидОбучения;
			
			Движение.ПродолжительностьВЧасах     = Документы.ПроведениеОбученияСУО.Продолжительность(ДанныеПроведенияОбучения) / 3600; 
			Движение.НаОсновеЭлектронногоРесурса = ДанныеПроведенияОбучения.НаОсновеЭлектронногоРесурса;
			Движение.ТолькоПросмотрВедомости     = ?(ДанныеПроведенияОбучения.НаОсновеМероприятия, Справочники.КаталогМероприятийСУО.ПреподавателюДоступенТолькоПросмотрВедомости(ДанныеПроведенияОбучения.Мероприятие, Роль), ТолькоПросмотрВедомости);
			Движение.Статус                      = Документы.ПроведениеПреподавателемОбученияСУО.СтатусПроцессаПреподавания(ЭтотОбъект);
			
		КонецЕсли;
		
		// Расписание преподавателей
		
		Если НЕ ВидОбучения.Общее Тогда
		
			Движение = Движения.РасписаниеПреподавателейСУО.Добавить();
			
			Движение.ПроведениеОбучения       = ПроведениеОбучения;
			
			Движение.Сценарий                    = Сценарий;
			
			Движение.Роль                        = Роль;
			
			Движение.Преподаватель               = Пользователь;
			Движение.Проведено                   = Проведено;
			Движение.ДатаНачалаПроведения        = ДатаНачалаПроведения;
			Движение.ДатаОкончанияПроведения     = ДатаОкончанияПроведения;
			
			Движение.Вид                         = ВидОбучения;
			
			Движение.РодительскоеПроведение      = РодительскоеПроведение;
			Движение.НаОсновеЭлектронногоРесурса = ДанныеПроведенияОбучения.НаОсновеЭлектронногоРесурса;
			
			Движение.ЦветНаКалендаре = Документы.ПроведениеОбученияСУО.ЦветНаКалендаре(ДанныеПроведенияОбучения, ВидОбучения, Перечисления.ТипыУчебныхАктивностейСУО.Преподавание);
			
						
		КонецЕсли;
		
		// Преподаватели мероприятий
		
		Движение = Движения.ПреподавателиОбученияСУО.Добавить();
		
		Движение.ПроведениеОбучения      = ПроведениеОбучения;
		Движение.Сценарий                = Сценарий;
		Движение.Преподаватель           = Пользователь;
		
		Движение.Роль                    = Роль;
		Движение.Проведено               = Проведено;
		Движение.ДатаНачалаПроведения    = ДатаНачалаПроведения;
		Движение.ДатаОкончанияПроведения = ДатаОкончанияПроведения;
		Движение.СкрыватьОтУченика       = ?(ДанныеПроведенияОбучения.НаОсновеМероприятия, Справочники.КаталогМероприятийСУО.ПреподавательСкрытОтУченика(ДанныеПроведенияОбучения.Мероприятие, Роль), СкрыватьОтУченика);
		
		// Библиотека пользователя

		ВыборкаРесурсовДляБиблиотеки = УправлениеОбучениемСУОПовтИсп.ВыборкаДанныхДляЗаполненияБиблиотекиПользователя(ДанныеПроведенияОбучения.Мероприятие, ПроведениеОбучения);		
		ДатаРазмещенияМатериала = ?(ЗначениеЗаполнено(ДатаНачалаПроведения), ДатаНачалаПроведения, Дата);		
		РегистрыСведений.БиблиотекаПользователейСУО.БиблиотекаПользователейЗаполнитьДвижения(Движения, Пользователь, ДатаРазмещенияМатериала, ВыборкаРесурсовДляБиблиотеки, Неопределено, ДанныеПроведенияОбучения.Статус, Ложь);
		
	КонецЕсли;
	
	Движения.Записать();
	
	Если ЗначениеЗаполнено(РодительскоеПроведение) Тогда
		ПерезаписатьРодительскоеПроведение(РежимЗаписиДокумента.Проведение)
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ЗначениеЗаполнено(РодительскоеПроведение) Тогда
		ПерезаписатьРодительскоеПроведение(РежимЗаписиДокумента.ОтменаПроведения)
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ПерезаписатьРодительскоеПроведение(РежимЗаписи)
		
	РодительскоеПроведениеОбъект = РодительскоеПроведение.ПолучитьОбъект();
	
	Попытка 
		РодительскоеПроведениеОбъект.Заблокировать();
	Исключение
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСТР("ru = 'Не удалось заблокировать объект %1'"),
			Строка(РодительскоеПроведениеОбъект));
	КонецПопытки;
		
	РодительскоеПроведениеОбъект.Записать(РежимЗаписи);
	РодительскоеПроведениеОбъект.Разблокировать();
	
КонецПроцедуры

Процедура ОбновитьПроведениеОбучения()
	
	РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(ПроведениеОбучения,,Истина,,3);
	
КонецПроцедуры

#КонецОбласти

ПометкаУдаленияИзменена = Ложь;

#КонецЕсли
